In [ ]:
cd "/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L26"

/content/drive/MyDrive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L26

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%pwd

'/content/drive/My Drive/Colab Notebooks/ANLY2500_02_Fall2025/LC/L26'

In [ ]:
%ls

L26_LCP.ipynb  sales.db

In [ ]:
%pip install jupysql duckdb duckdb-engine --quiet
# Load the SQL extension
%load_ext sql
# Setting: Show all rows
%config SqlMagic.displaylimit = None
# Connect to SQLite database
%sql sqlite:///sales.db


# Show tables
%sqlcmd tables


# Show columns in a table
%sqlcmd columns -t sale

   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.1/95.1 kB 2.0 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 49.7/49.7 kB 1.9 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 192.8/192.8 kB 2.5 MB/s eta 0:00:00
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 144.5/144.5 kB 2.7 MB/s eta 0:00:00

displaylimit: Value None will be treated as 0 (no limit)

Connecting to 'sqlite:///sales.db'

+------------------+---------+----------+---------+-------------+
|       name       |   type  | nullable | default | primary_key |
+------------------+---------+----------+---------+-------------+
|      RowNO       | INTEGER |   True   |   None  |      0      |
|     SaleDate     |   TEXT  |   True   |   None  |      0      |
|    CustomerID    | INTEGER |   True   |   None  |      0      |
|    FirstName     |   TEXT  |   True   |   None  |      0      |
|     LastName     |   TEXT  |   True   |   None  |      0      |
|     OrderID      | INTEGER |   True   |   None  |      0      |
|   ProductName    |   TEXT  |   True   |   None  |      0      |
|     Category     |   TEXT  |   True   |   None  |      0      |
|      Color       |   TEXT  |   True   |   None  |      0      |
|    SalePrice     |   REAL  |   True   |   None  |      0      |
|     Quantity     | INTEGER |   True   |   None  |      0      |
| ManufacturerName |   TEXT  |   True   |   None  |      0      |
+------------------+---------+----------+---------+-------------+

In [ ]:
%%sql
select *
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Amt,
       OrderID
from sale
group by OrderID
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+---------+
|        Amt         | OrderID |
+--------------------+---------+
| 364.86999999999995 |  191228 |
|       22.99        |  191229 |
|        53.1        |  191230 |
|       100.08       |  191231 |
|        72.0        |  191232 |
|       16.48        |  191233 |
|       18.99        |  191234 |
|       333.86       |  191235 |
|        28.7        |  191236 |
|       40.24        |  191237 |
+--------------------+---------+

In [ ]:
# sql: table
# select: columns
# from: a single table
# where: filtering (delete rows) a single table
# group by:
#    divide a single tables into multiple tables
# having: filtering tables (delete tables)
# order by:
# max() min() avg() count() sum()
#    : work on single table, result in a single row
%%sql
select 	SalePrice,	Quantity,
        SalePrice*Quantity as Subtotal
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-----------+----------+----------+
| SalePrice | Quantity | Subtotal |
+-----------+----------+----------+
|   57.65   |    1     |  57.65   |
|   63.05   |    1     |  63.05   |
|    96.6   |    1     |   96.6   |
|   116.99  |    1     |  116.99  |
|   15.29   |    2     |  30.58   |
|   22.99   |    1     |  22.99   |
|    53.1   |    1     |   53.1   |
|   50.04   |    2     |  100.08  |
|    72.0   |    1     |   72.0   |
|   16.48   |    1     |  16.48   |
+-----------+----------+----------+

In [ ]:
%%sql
select 	SalePrice*Quantity as Subtotal
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+----------+
| Subtotal |
+----------+
|  57.65   |
|  63.05   |
|   96.6   |
|  116.99  |
|  30.58   |
|  22.99   |
|   53.1   |
|  100.08  |
|   72.0   |
|  16.48   |
+----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+------------------+
|     Revenue      |
+------------------+
| 777599.279999984 |
+------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       SaleDate
from sale
group by SaleDate
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+-----------+
|      Revenue       |  SaleDate |
+--------------------+-----------+
| 188.55999999999997 |  1/1/2014 |
| 1451.8600000000004 |  1/1/2015 |
|       463.02       | 1/10/2014 |
| 1201.1000000000001 | 1/10/2015 |
| 1222.0000000000002 | 1/11/2014 |
|      1473.44       | 1/11/2015 |
|      1214.61       | 1/12/2014 |
|       130.05       | 1/12/2015 |
|      1484.97       | 1/13/2015 |
| 823.3000000000002  | 1/14/2014 |
+--------------------+-----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       SaleDate
from sale
group by SaleDate
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+------------+
|      Revenue       |  SaleDate  |
+--------------------+------------+
| 4014.6299999999983 | 12/30/2014 |
| 3568.6899999999982 | 8/10/2014  |
| 3483.209999999999  | 12/27/2014 |
| 3424.749999999999  | 7/12/2014  |
| 3376.759999999999  | 12/19/2014 |
| 3300.1199999999994 |  6/6/2014  |
| 3033.8099999999995 | 9/11/2015  |
| 2925.0699999999993 | 1/21/2014  |
| 2903.7400000000007 |  5/5/2015  |
| 2897.969999999999  | 12/1/2014  |
+--------------------+------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       CustomerID,
       FirstName
from sale
group by CustomerID
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+------------+-----------+
|      Revenue       | CustomerID | FirstName |
+--------------------+------------+-----------+
|       2393.0       |    5135    |   Magnus  |
| 2135.7899999999995 |    1096    |   Meliha  |
|      2008.75       |   13696    |    May    |
| 1805.8899999999996 |   13925    |  Gertrude |
| 1780.4199999999998 |   14396    |   Sally   |
| 1744.2400000000005 |    367     |    Andy   |
|      1734.49       |   12393    | Elisabeth |
| 1683.7699999999998 |   13618    |   Linda   |
|      1640.95       |   18123    |   Carmen  |
|      1582.55       |    3808    |  William  |
+--------------------+------------+-----------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       OrderID
from sale
group by OrderID
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+-------------------+---------+
|      Revenue      | OrderID |
+-------------------+---------+
| 856.5799999999999 |  194550 |
|       752.53      |  193661 |
|       736.2       |  191482 |
|       727.82      |  192433 |
| 723.0799999999999 |  192017 |
|       702.76      |  191315 |
|       698.93      |  194080 |
|       681.42      |  191901 |
| 668.6200000000001 |  194354 |
|       666.5       |  194285 |
+-------------------+---------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       ProductName
from sale
group by ProductName
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+------------------------------+
|      Revenue       |         ProductName          |
+--------------------+------------------------------+
| 13756.000000000007 |       nyc 83 sneakers        |
|       8955.0       |     nyc 83 vlc sneakers      |
| 7625.650000000001  |       ar 3.0 sneakers        |
| 7620.820000000001  |    top ten 2000 sneakers     |
|       6697.8       |   cesario hightop sneaker    |
| 6373.400000000002  | straight jacket vlc sneakers |
| 6124.999999999999  |    cesario lo xvi sneaker    |
| 5880.550000000001  |        lacava sneaker        |
|       5516.4       |     crazy fast sneakers      |
| 4866.480000000001  |        driving shoes         |
+--------------------+------------------------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       Category
from sale
group by Category
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+--------------+
|      Revenue       |   Category   |
+--------------------+--------------+
| 620275.3499999918  |   sneakers   |
| 52361.92000000002  |    boots     |
| 37094.77000000009  |   sandals    |
| 29901.470000000034 | casual shoes |
| 15895.36999999998  |    wedges    |
| 13139.659999999998 |    heels     |
| 8626.019999999993  |    flats     |
|       304.72       |   slippers   |
+--------------------+--------------+

In [ ]:
%%sql
select sum(SalePrice*Quantity) as Revenue,
       ManufacturerName
from sale
group by ManufacturerName
order by Revenue desc
limit 10
;

Running query in 'sqlite:///sales.db'

+--------------------+---------------------+
|      Revenue       |   ManufacturerName  |
+--------------------+---------------------+
| 109599.5700000001  |         Nike        |
| 104418.25000000006 |        Adidas       |
| 73795.86000000012  |     Fashion Lab     |
| 50428.97999999998  | Creative Recreation |
| 44206.17000000002  |         Puma        |
| 39640.060000000056 |        Reebok       |
| 38836.91000000001  |        Supra        |
| 32040.12000000006  |         Fila        |
| 28991.08000000001  |        Osiris       |
| 28030.980000000014 |      Timberland     |
+--------------------+---------------------+

In [ ]:
%%sql
select sum(Quantity) as NSold
from sale
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+
| NSold |
+-------+
| 14469 |
+-------+

In [ ]:
%%sql
select sum(Quantity) as NSold,
       ProductName
from sale
group by ProductName
order by NSold asc
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+-----------------------------------+
| NSold |            ProductName            |
+-------+-----------------------------------+
|   1   |      574 core suede sneakers      |
|   1   |    air force max 2013 sneakers    |
|   1   |           ally sneakers           |
|   1   |           amazing slide           |
|   1   |   anne peep toe platform sandal   |
|   1   | anne platform bottom heel w/print |
|   1   |           antonio shoes           |
|   1   |      anvil mid mountain boot      |
|   1   |          ar 2.0 sneakers          |
|   1   |            atropos boot           |
+-------+-----------------------------------+

In [ ]:
%%sql
select sum(Quantity) as NSold,
       ProductName
from sale
group by ProductName
having sum(Quantity)>100
order by NSold desc
limit 10
;

Running query in 'sqlite:///sales.db'

+-------+---------------------+
| NSold |     ProductName     |
+-------+---------------------+
|  180  |   nyc 83 sneakers   |
|  125  | nyc 83 vlc sneakers |
+-------+---------------------+

In [ ]:
%%sql
select *
from sale
limit 10;

Running query in 'sqlite:///sales.db'

+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
| RowNO |  SaleDate  | CustomerID | FirstName |  LastName | OrderID |               ProductName               | Category |    Color     | SalePrice | Quantity | ManufacturerName |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+
|   1   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        be mini vulc wns sneakers        | sneakers |    Black     |   57.65   |    1     |       Puma       |
|   2   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |              liga sneakers              | sneakers |     Blue     |   63.05   |    1     |       Puma       |
|   3   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     nike air max correlate sneakers     | sneakers |    Black     |    96.6   |    1     |       Nike       |
|   4   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |     timberland icon 6" premium boots    |  boots   |    Black     |   116.99  |    1     |    Timberland    |
|   5   | 12/31/2013 |    1134    |  Xiafeng  |    Wang   |  191228 |        torry wedge tapestry wedge       |  wedges  | Green,Multi  |   15.29   |    2     |   Fashion Lab    |
|   6   | 12/31/2013 |   14958    |  Russell  |   Baker   |  191229 |  juno buckle animal trim wedge sneaker  |  boots   | Animal Print |   22.99   |    1     |  Apple Bottoms   |
|   7   | 12/31/2013 |    3275    |  Herschel |  Webster  |  191230 |          suede classic sneakers         | sneakers |    Purple    |    53.1   |    1     |       Puma       |
|   8   |  1/1/2014  |   17448    |  Margret  |  Gilmore  |  191231 | natalia high platform suede fringe boot |  boots   |    Black     |   50.04   |    2     |      Dereon      |
|   9   |  1/1/2014  |   11852    |    Ken    |   Carey   |  191232 |           nyc 83 vlc sneakers           | sneakers |    Black     |    72.0   |    1     |      Osiris      |
|   10  |  1/1/2014  |    5230    |    Toru   | Sakaguchi |  191233 |                 chehalis                | sneakers |    Black     |   16.48   |    1     |  Royal Elastics  |
+-------+------------+------------+-----------+-----------+---------+-----------------------------------------+----------+--------------+-----------+----------+------------------+